
<?php
/* 数据类型 - 字符串

    声明字符串的方式
    1. 单引号声明  ''
    2. 双引号声明 " "
    3. 定界符声明
        需要输入很多 html标签使用

    
    ## 1 单引号 声明
    $str = '青，取之于蓝，而青于蓝'

    ## 2 双引号 声明
    $str = "青，取之于蓝，而青于蓝";

    ## 单引号和双引号的区别
    - 双引号声明解析变量， 单引号不解析变量
    - 单引号的性能高于双引号，尽量用单引号
    - 双引号解析转义字符，单引号不解析转义字符，但是单引号能解析 \' & \
        + 网页上看不出效果，要看源代码
        + 双引号 转义 \"， 单引号不能转义 \"，只能转义 \'

    - 如果在双引号里面插入变量时候，后面不想有空格， 可以用花括号 {} 将变量包起来
        $str = "$php aaa";

    - 在双引号好里面插入变量，变量后面如果有英文或中文字符，它会把这个字符和变量拼接起来，视为一个变量，一定要在 变量后面加上特殊字符分开，如 空格分开
        $str = " {$php}aaa ";
    
    - 单引号和双引号可以嵌套，双引号中插入单引号，单引号中插入变量，这个变量会解析
        + 双引号嵌套单引号，变量会解析
        + 单引号中嵌套双引号，这个变量不会解析
        $title = "这是标题 '$php' ";

        字符串拼接 . 
            + 可以拼接变量

    ## 定界符 heredocs
        - Mytitle 可以随便定义
        - 结束标识符必须顶格写，前面不能有空格，必须要有分号结尾
        - 解析变量、转义字符和内容

        heredocs 语法：
        <<<标识符 
            中间写大段的文本 
        标识符; // 结束表示符要顶格写


        定界符 Heredoc 和双引号类似，能解析变量
        定界符 Nowdoc 和单引号类似，不解析变量

    ## 定界符 nowdocs
        nowdocs 与 heredocs的区别 ：nowdocs 标识符两边用单引号包起来
        nowdocs 语法：
        <<<'标识符' 
            中间写大段的文本 
        标识符; // 结束表示符要顶格写

        - 不解析变量、转义字符和内容，是什么内容就显示什么内容


    ## 不可见字符
    - 主要是计算机规定的一些特殊符号，例如：回车 \n， 缩进 \t 

*/
    // 定界符
    $head = <<<Mytitle
    <h1>这是标题</h1>
    <p>这是段落</p>
    <ul>
        <li>列表111</li>
        <li>列表222</li>
        <li>列表333</li>
    </ul>
    <footer>这是尾部</footer>
Mytitle;

    echo $head . '<br>';  


    // 单引号
    $str = 'zheshi\'lala';
    // $str1= 'zheshi\\lala';
    $str1= 'zheshi\nlala';

    $str1= 'zheshi \n la  \t la'; // 直接显示 \n \t

    // 双引号 \n 回车  \t tab缩进
    // $str1= "zheshi \n la  \t la";

    echo $str .'<br>';
    echo $str1.'<br><hr>';


    // 双引号
    $double = "lulongwen";
    $double2 = "出来'$double'直接显示出来 ";
    $double3 = '出来 "{$double}" 直接显示出来 ';
    echo $double .'<br>';
    echo $double2 .'<br>';
    echo $double3 .'<br>';
?>